const lang = {
  locale: 'th',
  menu: 'เมนู',
  first_name: 'เลิศดี',
  last_name: 'วิเวชไพศาลกุล',
  contacts: 'ข้อมูลติดต่อ',
  profile: 'โปรไฟล์',
  coding: 'การเขียนโค้ด',
  year: 'ปี',

  // profile
  personal: 'ข้อมูลส่วนบุคคล',
  my_birthday: '21 ธันวาคม 2539',
  my_phone: '0845428595',
  my_email: 'deelerdkub@gmail.com',
  my_address: 'บ้านเลขที่ 70 ซอยนาคนิวาส 21 แยก 2-3 ถนนนาคนิวาส เขตลาดพร้าว จังหวัดกรุงเทพมหานคร 10230',
  interests_and_hobbies: 'ความสนใจและงานอดิเรก',
  computer: 'คอมพิวเตอร์',
  book: 'หนังสือ',
  music: 'เพลง',
  camera: 'ถ่ายรูป',
  badminton: 'แบดมินตัน',
  travel: 'ท่องเที่ยว',
  education: 'การศึกษา',
  my_education: `สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง`,
  my_bachelor: 'วิศวกรรมศาสตรบัณฑิต - วิศวกรรมคอมพิวเตอร์',
  my_gpa: 'เกรดเฉลี่ย : 3.27',
  skills: 'ทักษะ',
  objective: 'วัตถุประสงค์',
  my_objective: [
    'พัฒนาความรู้และความสามารถเพื่อก้าวสู่การเป็นเจ้าของธุรกิจ',
    'ใช้ความรู้และความสามารถที่มีอยู่ให้เกิดประโยชน์สูงสุด'
  ],
  qualification: 'คุณสมบัติ',
  my_qualification: [
    'เชื่อถือได้ มีความรับผิดชอบ และ มีแรงจูงใจในตนเอง',
    'เปิดใจ กระตือรือร้นที่จะเรียนรู้สิ่งใหม่ๆ',
    'ตรงต่อเวลาและมีความเพียรพยายาม',
    'มีความคิดสร้างสรรค์',
  ],
  work_experience: 'ประสบการณ์การทำงาน',
  total_experience: 'ประสบการณ์ทั้งหมด',
  title: 'หัวข้อ',
  position: 'ตำแหน่ง',
  duration: 'ระยะเวลา',
  company_description: 'รายละเอียดบริษัท',
  project: 'โปรเจค',
  project_description: 'รายละเอียดโปรเจค',
  responsibility: 'ความรับผิดชอบ',
  success: 'ความสำเร็จ',
  reference: 'การอ้างอิง',
  links: 'ลิงค์',
  my_experience: [{
    company_name: 'เรดดี้แพลนเน็ต',
    position: 'นักพัฒนาซอฟต์แวร์',
    start_date: '2019-06-04',
    end_date: '2021-04-30',
    company_description: `เรดดี้แพลนเน็ตคือผู้ให้บริการแพลตฟอร์มด้านการขายและตลาดแบบ All-in-One ที่มีทีมงานผู้เชี่ยวชาญมากกว่า 150+ คน
     ทั้งด้านแพลตฟอร์ม และโฆษณาดิจิทัลที่ได้รับ Certified และเป็นพาร์ทเนอร์กับ Google เป็นรายแรกในประเทศไทย 
     มีความมุ่งมั่นที่จะช่วยผลักดันให้ธุรกิจ SMEs และองค์กรในประเทศไทยประสบความสำเร็จด้วยประสบการณ์กว่า 20 ปี ตั้งแต่ปี 2000 
     ในปัจจุบัน เรดดี้แพลนเน็ตได้รับความไว้วางใจจากผู้ประกอบการ บริษัท สมาคม และองค์กรชั้นนำในประเทศไทยกว่า 15,000+ ธุรกิจ
     ที่ใช้แพลตฟอร์มในการทำเว็บ, สร้างเว็บ, ออกแบบเว็บ, โมบายล์แอพ, ระบบ CRM และอีกมากมาย`,
    project: 'PointSpot',
    project_description: `ระบบสะสมแต้มด้วยเบอร์โทรศัพท์ เพื่อช่วยกระตุ้นยอดขาย สร้างการซื้อซ้ำ ให้ลูกค้ากลับมาใช้บริการบ่อยมากขึ้น 
      ใช้งานง่ายมีฟังก์ชันการทำงานมากมายเช่น ให้แต้มลูกค้า, จัดการสมาชิก, จัดการคูปองและของรางวัล, และดูสถิติรายงานต่าง ๆ`,
    responsibility: [
      'พัฒนาเว็บแอปพลิเคชันเกี่ยวกับระบบสะสมแต้ม (PointSpot) (พัฒนาฟีเจอร์ ปรับปรุงประสิทธิภาพ แก้ไขบั๊ก และ จัดทำรายงาน)',
      'วางแผนออกแบบและพูดคุยกับทีมเพื่อการพัฒนาที่มีประสิทธิภาพ',
      'พัฒนา frontend ด้วย HTML/CSS และ ReactJS/Redux',
      'พัฒนา backend ด้วย NodeJS และ จัดการข้อมูลด้วย PostgreSQL',
      'จัดทำรายงานด้วย Grafana'
    ],
    success: [
      'ได้เรียนรู้กระบวนการ การทำงาน และ การทำงานเป็นทีม',
      'ได้เรียนรู้ทักษะการเขียนโค้ดแบบใหม่',
      'ได้พัฒนาทักษะการวางแผน กระบวนการคิด และ การตัดสินใจ',
      'โปรเจคที่รับผิดชอบมีฟังก์ชันการทำงานและประสิทธิภาพที่มากขึ้น'
    ],
    reference: [{ name: 'ภิสิทธิ์ กรรณสูต', contact: '0636695587' }],
    link_company: ['https://www.readyplanet.com', 'https://th.pointspot.co'],
  }, {
    company_name: 'วิทยานิพนธ์',
    position: '',
    start_date: '2018-08-01',
    end_date: '2019-04-30',
    company_description: `สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง`,
    project: 'การประมูลด้วยวิธีการทางอิเล็กทรอนิกส์แบบชาญฉลาด',
    project_description: `ในปัจจุบันมีผู้คนที่ซื้อขายสินค้าผ่านช่องทางออนไลน์เป็นจำนวนมาก การประมูลและเสนอราคา 
    เป็นรูปแบบหนึ่งของการซื้อขายที่ได้รับความนิยมแต่ยังไม่มีแอปพลิเคชันไหนที่รองรับการซื้อขายในรูปแบบนี้ 
    ดังนั้นจึงได้มีการจัดทำแอปพลิเคชันที่ช่วยอำนวยความสะดวกในเรื่องของการประมูลซื้อขายและเสนอราคาสินค้า 
    โดยที่ผู้ใช้งานแอปพลิเคชันจะสามารถเปิดประมูลสินค้าหรือสามารถตั้งขายสินค้าของตนเองได้เพื่อให้คนที่สนใจสินค้าเข้ามาทำการประมูลหรือเสนอราคา 
    ซึ่งแอปพลิเคชันจะมีฟังก์ชันการทำงานที่ง่ายต่อการใช้งานและฟังก์ชันที่อำนวยความสะดวกสบายทั้งผู้ซื้อและผู้ขาย 
    การจัดหมวดหมู่ของสินค้าจากรูปถ่ายของสินค้า หรือ ฟังก์ชันที่ช่วยให้ผู้ใช้งานสามารถลองสินค้าได้ ระบบแนะนำสินค้าที่
    จะแนะนำสินค้าโดยอ้างอิงจากพฤติกรรมของผู้ใช้งาน และ ฟังก์ชันที่ทำให้ผู้ขายสามารถแสดงสินค้าได้หลากหลายมุมมอง เป็นต้น`,
    responsibility: [
      'ศึกษาและทำความเข้าใจเกี่ยวกับ Machine learning and Deep learning',
      'ศึกษาหลักการของ Convolutional Neural Network',
      'ทำระบบจัดหมวดหมู่สินค้าอัตโนมัติ โดยการทำนายภาพถ่ายที่รับเข้ามาว่าเป็นสินค้าหมวดหมู่ใดและแสดงหมวดหมู่ของสินค้าให้อัตโนมัติ ถ่ายภาพเพื่อสอนโมเดลและทดสอบ',
      `ทำระบบแนะนำสินค้า ใช้วิธีการวิเคราะห์ใบหน้าของผู้ใช้จากรูปถ่าย โดยจะใช้เครื่องมือที่มีชื่อว่า Microsoft Azure ซึ่งเมื่อได้ผลลัพธ์จากการวิเคราะห์ใบหน้า คือ เพศ อายุ อุปกรณ์สวมใส่ (หมวก,แว่นตา) สีผม การแต่งหน้า แอปพลิเคชันก็จะนำข้อมูลที่ได้มาใช้ในการแนะนำสินค้าให้กับผู้ใช้ผ่านเงื่อนไขที่กำหนด`,
      'จัดทำวิทยานิพนธ์และนำเสนอ'
    ],
    success: [
      'ได้รับเกรด A',
      'โปรเจคสามารถเป็นฐานให้รุ่นน้องนำไปต่อยอดได้'
    ],
    reference: [{ name: 'ผศ.ดร.พิกุลแก้ว ตังติสานนท์' }],
    link_company: []
  }, {
    company_name: 'ฝึกงาน',
    position: 'วิศวกรข้อมูล',
    start_date: '2018-06-04',
    end_date: '2018-08-03',
    company_description: `กสิกร เทคโนโลยี กรุ๊ป เซเครเทเรียต จำกัด`,
    project: 'การเสนอขายผลิตภัณฑ์ - กองทุนรวม',
    project_description: `วิเคราะห์ข้อมูลลูกค้าเพื่อใช้ในการนำเสนอผลิตภัณฑ์กองทุนรวมให้เหมาะสบกับกลุ่มลูกค้า`,
    responsibility: [
      'เรียนรู้และศึกษาให้เข้าใจถึงหน้าที่และกระบวนการต่างๆ ของงานรวมถึงซอฟต์แวร์ที่ต้องใช้ในการทำงานจากผู้มีประสบการณ์และวิทยากร',
      'คิดไอเดียเกี่ยวกับหัวข้องานที่ทางบริษัทกำหนดมาให้ว่าเราจะทำอะไรทำยังไงทำเพื่อใครแก้ปัญหาอะไรได้มีผลประโยชน์อย่างไร',
      'สำรวจและทำความเข้าใจข้อมูลที่บริษัทให้มาโดยการเขียนภาษา SQL บน impala ผ่าน HUE',
      `ทำ data visualization เพื่อดูแนวโน้มของข้อมูลและทำความเข้าใจข้อมูลผ่านกราฟต่าง ๆ โดยการเขียนภาษา python ใน jupyter`,
      'ศึกษาเกี่ยวกับ ภาษา python และ machine learning เพิ่มเติมเพื่อให้เข้าใจและใช้งานได้อย่างเต็มประสิทธิภาพและถูกต้องที่สุด',
      'เขียนโมเดลเพื่อทำนายลูกค้าที่มีแนวโน้มจะซื้อกองทุนและจัดเตรียมการนำเสนอโปรเจคให้กับคนภายในบริษัทฟังแล้วเข้าใจ',
      'แข่ง Pitching กับกลุ่มอื่นๆ'
    ],
    success: [
      'ได้รับรางวัลทีมเวิร์คจากการแข่ง Pitching',
      `ได้เรียนรู้การทำงานเป็นทีม การประสานงานในทีมให้งานมีความคล่องตัวและเป็นไปได้ด้วยดี`,
      `การวางแผนการทำงานและขอบเขตของงานตั้งแต่เริ่มทำไปจนถึงเสร็จงาน`,
      `ได้เรียนรู้การบริหารจัดการเวลาในการทำงาน`,
      `ได้เรียนรู้ทฤษฎีความรู้ต่างๆ ที่ไม่เคยรู้มาก่อน รู้วิธีแก้ไขปัญหาต่างๆ ที่เกิดขึ้น`,
      `มีความรับผิดชอบในหน้าที่ของตนเองมากขึ้น มีความรอบคอบมากขึ้น`,
      `ได้เรียนรู้หลักการนำเสนองานที่ดี`
    ],
    reference: [],
    link_company: []
  }],
  job_interests: 'งานที่สนใจ',
  my_job_interests: [
    'Full stack developer',
    'Frontend developer'
  ],

  // coding
  wheel_game: 'เกมวงล้อ',
  random_value: 'ค่าที่ต้องการสุ่ม',
  add_piece_wheel: 'เพิ่มค่าสุ่ม',
  error_value_wheel: 'กรุณากำหนดค่าสุ่ม',
  set_random_value: 'กำหนดค่าที่ต้องการสุ่ม',
  min_piece_wheel: 'ขั้นต่ำ',
  max_piece_wheel: 'สูงสุด',
  piece: 'ชิ้น',
};

export default lang;